In [3]:
from dashboard import data

data.get_popular_all_time()

        artist     ct
0       Prince  11336
1        Wilco   9751
2  David Bowie   9679
3        Spoon   9384
4         Beck   9209

In [4]:
data.get_popular_all_time_timeseries()

/Users/jason.motylinski/Downloads/thecurrent/dashboard/data.py:152: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  return pd.read_json(r.get(key).decode())

           artist  year  month year_month  ct
0           Spoon  2005     12    2005-12  10
1            Beck  2005     12    2005-12   8
2     David Bowie  2005     12    2005-12   8
3          Prince  2005     12    2005-12   5
4           Wilco  2005     12    2005-12  10
...           ...   ...    ...        ...  ..
1090        Spoon  2024      2     2024-2  16
1091        Wilco  2024      2     2024-2  26
1092         Beck  2024      2     2024-2  13
1093       Prince  2024      2     2024-2  26
1094  David Bowie  2024      2     2024-2  16

[1095 rows x 5 columns]